In [3]:
# Required for Notebook to use SQL Magic
# Facilitates to run queries from Notebooks 
# without using Python Code                     
!pip install ipython-sql

Requirement already satisfied: ipython-sql in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython-sql) (8.26.0)
Requirement already satisfied: six in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=2.0 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython-sql) (2.0.32)
Requirement already satisfied: sqlparse in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: ipython-genutils in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: decorator in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: traitlets>=5.13.0 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: matplotlib-inline in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: jedi>=0.16 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: stack-data in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: colorama in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: pygments>=2.4.0 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: exceptiongroup in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from ipython->ipython-sql) (1.2.2)
Requirement already satisfied: wcwidth in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: asttokens>=2.1.0 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.3)
Requirement already satisfied: executing>=1.2.0 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)

[notice] A new release of pip available: 22.3.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
# Native Postgres Library to connect to Posgres Database Server
!pip install    psycopg2-binary

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.9-cp310-cp310-win_amd64.whl (1.2 MB)
     ---------------------------------------- 1.2/1.2 MB 6.2 MB/s eta 0:00:00
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.9

[notice] A new release of pip available: 22.3.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
    # SQLAlchemy is ORM and needs native database libraries (psycopg2)
# Pandas internally uses SQL Alchemy to connect to database
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (2.0.32)
Requirement already satisfied: typing-extensions>=4.6.0 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in f:\data ng\file format convertor\app-file-format-convertor\ffc-venv\lib\site-packages (from sqlalchemy) (3.0.3)

[notice] A new release of pip available: 22.3.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import os
os.environ.update({"DB_HOST":"localhost"})

In [3]:
os.environ.get("DB_HOST")

'localhost'

In [4]:
#without using os module
%env DB_HOST1 = localhost

env: DB_HOST1=localhost

In [5]:
os.environ.get("DB_HOST1")

'localhost'

to load the sql we need to use below command

In [6]:
%load_ext sql

to get the database connection need to set the environment variable and the syntax follows like this

In [7]:
#syntax for sqlalchemy to get the databse connection
%env DATABASE_URL = postgresql://postgres:1234567@localhost:5432/local_retail_db

env: DATABASE_URL=postgresql://postgres:1234567@localhost:5432/local_retail_db

In [8]:
%env DATABASE_URL

'postgresql://postgres:1234567@localhost:5432/local_retail_db'

In [9]:
%%sql
SELECT * FROM orders LIMIT  10

10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 11599, 'CLOSED'),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 256, 'PENDING_PAYMENT'),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 12111, 'COMPLETE'),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 8827, 'CLOSED'),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 11318, 'COMPLETE'),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 7130, 'COMPLETE'),
 (7, datetime.datetime(2013, 7, 25, 0, 0), 4530, 'COMPLETE'),
 (8, datetime.datetime(2013, 7, 25, 0, 0), 2911, 'PROCESSING'),
 (9, datetime.datetime(2013, 7, 25, 0, 0), 5657, 'PENDING_PAYMENT'),
 (10, datetime.datetime(2013, 7, 25, 0, 0), 5648, 'PENDING_PAYMENT')]

How it is executing ?
1.Initally we need to the set the env variable to the key of DATABASE_URL 
2. To run the sql queries in notebook we need to add %%sql (magic cmds)
3.The magic commands internally establishes a connection and then it will run the query on it

In [10]:
#Here will see how to connect to database and run queries using pandas

In [11]:
import pandas as pd

In [12]:
help(pd.read_sql)

Help on function read_sql in module pandas.io.sql:

read_sql(sql, con, index_col: 'str | list[str] | None' = None, coerce_float: 'bool' = True, params=None, parse_dates=None, columns: 'list[str] | None' = None, chunksize: 'int | None' = None, dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>, dtype: 'DtypeArg | None' = None) -> 'DataFrame | Iterator[DataFrame]'
    Read SQL query or database table into a DataFrame.

    This function is a convenience wrapper around ``read_sql_table`` and
    ``read_sql_query`` (for backward compatibility). It will delegate
    to the specific function depending on the provided input. A SQL query
    will be routed to ``read_sql_query``, while a database table name will
    be routed to ``read_sql_table``. Note that the delegated function might
    have more specific notes about their functionality not listed here.

    Parameters
    ----------
    sql : str or SQLAlchemy Selectable (select or text object)
        SQL query to be executed or a table name.
    con : ADBC Connection, SQLAlchemy connectable, str, or sqlite3 connection
        ADBC provides high performance I/O with native type support, where available.
        Using SQLAlchemy makes it possible to use any DB supported by that
        library. If a DBAPI2 object, only sqlite3 is supported. The user is responsible
        for engine disposal and connection closure for the ADBC connection and
        SQLAlchemy connectable; str connections are closed automatically. See
        `here <https://docs.sqlalchemy.org/en/20/core/connections.html>`_.
    index_col : str or list of str, optional, default: None
        Column(s) to set as index(MultiIndex).
    coerce_float : bool, default True
        Attempts to convert values of non-string, non-numeric objects (like
        decimal.Decimal) to floating point, useful for SQL result sets.
    params : list, tuple or dict, optional, default: None
        List of parameters to pass to execute method.  The syntax used
        to pass parameters is database driver dependent. Check your
        database driver documentation for which of the five syntax styles,
        described in PEP 249's paramstyle, is supported.
        Eg. for psycopg2, uses %(name)s so use params={'name' : 'value'}.
    parse_dates : list or dict, default: None
        - List of column names to parse as dates.
        - Dict of ``{column_name: format string}`` where format string is
          strftime compatible in case of parsing string times, or is one of
          (D, s, ns, ms, us) in case of parsing integer timestamps.
        - Dict of ``{column_name: arg dict}``, where the arg dict corresponds
          to the keyword arguments of :func:`pandas.to_datetime`
          Especially useful with databases without native Datetime support,
          such as SQLite.
    columns : list, default: None
        List of column names to select from SQL table (only used when reading
        a table).
    chunksize : int, default None
        If specified, return an iterator where `chunksize` is the
        number of rows to include in each chunk.
    dtype_backend : {'numpy_nullable', 'pyarrow'}, default 'numpy_nullable'
        Back-end data type applied to the resultant :class:`DataFrame`
        (still experimental). Behaviour is as follows:

        * ``"numpy_nullable"``: returns nullable-dtype-backed :class:`DataFrame`
          (default).
        * ``"pyarrow"``: returns pyarrow-backed nullable :class:`ArrowDtype`
          DataFrame.

        .. versionadded:: 2.0
    dtype : Type name or dict of columns
        Data type for data or columns. E.g. np.float64 or
        {'a': np.float64, 'b': np.int32, 'c': 'Int64'}.
        The argument is ignored if a table is passed instead of a query.

        .. versionadded:: 2.0.0

    Returns
    -------
    DataFrame or Iterator[DataFrame]

    See Also
    --------
    read_sql_table : Read SQL database table into a DataFrame.
    read_sql_query : Read SQL query into a DataFrame.

    Examples
    --------
    Read data from SQL via either a SQL query or a SQL tablename.
    When using a SQLite database only SQL queries are accepted,
    providing only the SQL tablename will result in an error.

    >>> from sqlite3 import connect
    >>> conn = connect(':memory:')
    >>> df = pd.DataFrame(data=[[0, '10/11/12'], [1, '12/11/10']],
    ...                   columns=['int_column', 'date_column'])
    >>> df.to_sql(name='test_data', con=conn)
    2

    >>> pd.read_sql('SELECT int_column, date_column FROM test_data', conn)
       int_column date_column
    0           0    10/11/12
    1           1    12/11/10

    >>> pd.read_sql('test_data', 'postgres:///db_name')  # doctest:+SKIP

    Apply date parsing to columns through the ``parse_dates`` argument
    The ``parse_dates`` argument calls ``pd.to_datetime`` on the provided columns.
    Custom argument values for applying ``pd.to_datetime`` on a column are specified
    via a dictionary format:

    >>> pd.read_sql('SELECT int_column, date_column FROM test_data',
    ...             conn,
    ...             parse_dates={"date_column": {"format": "%d/%m/%y"}})
       int_column date_column
    0           0  2012-11-10
    1           1  2010-11-12

    .. versionadded:: 2.2.0

       pandas now supports reading via ADBC drivers

    >>> from adbc_driver_postgresql import dbapi  # doctest:+SKIP
    >>> with dbapi.connect('postgres:///db_name') as conn:  # doctest:+SKIP
    ...     pd.read_sql('SELECT int_column FROM test_data', conn)
       int_column
    0           0
    1           1

In [13]:
connection_uri = 'postgresql://postgres:1234567@localhost:5432/local_retail_db'

In [14]:
pd.read_sql('orders',connection_uri)

       order_id order_date  order_customer_id     order_status
0             1 2013-07-25              11599           CLOSED
1             2 2013-07-25                256  PENDING_PAYMENT
2             3 2013-07-25              12111         COMPLETE
3             4 2013-07-25               8827           CLOSED
4             5 2013-07-25              11318         COMPLETE
...         ...        ...                ...              ...
68878     68879 2014-07-09                778         COMPLETE
68879     68880 2014-07-13               1117         COMPLETE
68880     68881 2014-07-19               2518  PENDING_PAYMENT
68881     68882 2014-07-22              10000          ON_HOLD
68882     68883 2014-07-23               5533         COMPLETE

[68883 rows x 4 columns]

In [15]:
query = '''
SELECT order_status,COUNT(*) AS order_count
FROM orders GROUP BY 1
ORDER BY 2 DESC'''

In [16]:
pd.read_sql(query,connection_uri)

      order_status  order_count
0         COMPLETE        22899
1  PENDING_PAYMENT        15030
2       PROCESSING         8275
3          PENDING         7610
4           CLOSED         7556
5          ON_HOLD         3798
6  SUSPECTED_FRAUD         1558
7         CANCELED         1428
8   PAYMENT_REVIEW          729

In [17]:
def get_column_names(schemas, ds_name, sorting_key='column_position'):
    column_details = schemas[ds_name]
    columns = sorted(column_details, key=lambda col: col[sorting_key])
    return [col['column_name'] for col in columns]

In [18]:
def read_csv(file, schemas):
    file_path_list = re.split('[/\\\]', file)
    ds_name = file_path_list[-2]
    file_name = file_path_list[-1]
    columns = get_column_names(schemas, ds_name)
    df = pd.read_csv(file, names=columns)
    return df

In [19]:
import json

In [28]:
schemas = json.load(open("data/retail_db/schemas.json"))

In [29]:
columns = get_column_names(schemas,'orders')

In [30]:
columns

['order_id', 'order_date', 'order_customer_id', 'order_status']

In [31]:
df = pd.read_csv('data/retail_db/orders/part-00000',names = columns)

In [32]:
df

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [33]:
help(df.to_sql)

Help on method to_sql in module pandas.core.generic:

to_sql(name: 'str', con, *, schema: 'str | None' = None, if_exists: "Literal['fail', 'replace', 'append']" = 'fail', index: 'bool_t' = True, index_label: 'IndexLabel | None' = None, chunksize: 'int | None' = None, dtype: 'DtypeArg | None' = None, method: "Literal['multi'] | Callable | None" = None) -> 'int | None' method of pandas.core.frame.DataFrame instance
    Write records stored in a DataFrame to a SQL database.

    Databases supported by SQLAlchemy [1]_ are supported. Tables can be
    newly created, appended to, or overwritten.

    Parameters
    ----------
    name : str
        Name of SQL table.
    con : sqlalchemy.engine.(Engine or Connection) or sqlite3.Connection
        Using SQLAlchemy makes it possible to use any DB supported by that
        library. Legacy support is provided for sqlite3.Connection objects. The user
        is responsible for engine disposal and connection closure for the SQLAlchemy
        connectable. See `here                 <https://docs.sqlalchemy.org/en/20/core/connections.html>`_.
        If passing a sqlalchemy.engine.Connection which is already in a transaction,
        the transaction will not be committed.  If passing a sqlite3.Connection,
        it will not be possible to roll back the record insertion.

    schema : str, optional
        Specify the schema (if database flavor supports this). If None, use
        default schema.
    if_exists : {'fail', 'replace', 'append'}, default 'fail'
        How to behave if the table already exists.

        * fail: Raise a ValueError.
        * replace: Drop the table before inserting new values.
        * append: Insert new values to the existing table.

    index : bool, default True
        Write DataFrame index as a column. Uses `index_label` as the column
        name in the table. Creates a table index for this column.
    index_label : str or sequence, default None
        Column label for index column(s). If None is given (default) and
        `index` is True, then the index names are used.
        A sequence should be given if the DataFrame uses MultiIndex.
    chunksize : int, optional
        Specify the number of rows in each batch to be written at a time.
        By default, all rows will be written at once.
    dtype : dict or scalar, optional
        Specifying the datatype for columns. If a dictionary is used, the
        keys should be the column names and the values should be the
        SQLAlchemy types or strings for the sqlite3 legacy mode. If a
        scalar is provided, it will be applied to all columns.
    method : {None, 'multi', callable}, optional
        Controls the SQL insertion clause used:

        * None : Uses standard SQL ``INSERT`` clause (one per row).
        * 'multi': Pass multiple values in a single ``INSERT`` clause.
        * callable with signature ``(pd_table, conn, keys, data_iter)``.

        Details and a sample callable implementation can be found in the
        section :ref:`insert method <io.sql.method>`.

    Returns
    -------
    None or int
        Number of rows affected by to_sql. None is returned if the callable
        passed into ``method`` does not return an integer number of rows.

        The number of returned rows affected is the sum of the ``rowcount``
        attribute of ``sqlite3.Cursor`` or SQLAlchemy connectable which may not
        reflect the exact number of written rows as stipulated in the
        `sqlite3 <https://docs.python.org/3/library/sqlite3.html#sqlite3.Cursor.rowcount>`__ or
        `SQLAlchemy <https://docs.sqlalchemy.org/en/20/core/connections.html#sqlalchemy.engine.CursorResult.rowcount>`__.

        .. versionadded:: 1.4.0

    Raises
    ------
    ValueError
        When the table already exists and `if_exists` is 'fail' (the
        default).

    See Also
    --------
    read_sql : Read a DataFrame from a table.

    Notes
    -----
    Timezone aware datetime columns will be written as
    ``Timestamp with timezone`` type with SQLAlchemy if supported by the
    database. Otherwise, the datetimes will be stored as timezone unaware
    timestamps local to the original timezone.

    Not all datastores support ``method="multi"``. Oracle, for example,
    does not support multi-value insert.

    References
    ----------
    .. [1] https://docs.sqlalchemy.org
    .. [2] https://www.python.org/dev/peps/pep-0249/

    Examples
    --------
    Create an in-memory SQLite database.

    >>> from sqlalchemy import create_engine
    >>> engine = create_engine('sqlite://', echo=False)

    Create a table from scratch with 3 rows.

    >>> df = pd.DataFrame({'name' : ['User 1', 'User 2', 'User 3']})
    >>> df
         name
    0  User 1
    1  User 2
    2  User 3

    >>> df.to_sql(name='users', con=engine)
    3
    >>> from sqlalchemy import text
    >>> with engine.connect() as conn:
    ...    conn.execute(text("SELECT * FROM users")).fetchall()
    [(0, 'User 1'), (1, 'User 2'), (2, 'User 3')]

    An `sqlalchemy.engine.Connection` can also be passed to `con`:

    >>> with engine.begin() as connection:
    ...     df1 = pd.DataFrame({'name' : ['User 4', 'User 5']})
    ...     df1.to_sql(name='users', con=connection, if_exists='append')
    2

    This is allowed to support operations that require that the same
    DBAPI connection is used for the entire operation.

    >>> df2 = pd.DataFrame({'name' : ['User 6', 'User 7']})
    >>> df2.to_sql(name='users', con=engine, if_exists='append')
    2
    >>> with engine.connect() as conn:
    ...    conn.execute(text("SELECT * FROM users")).fetchall()
    [(0, 'User 1'), (1, 'User 2'), (2, 'User 3'),
     (0, 'User 4'), (1, 'User 5'), (0, 'User 6'),
     (1, 'User 7')]

    Overwrite the table with just ``df2``.

    >>> df2.to_sql(name='users', con=engine, if_exists='replace',
    ...            index_label='id')
    2
    >>> with engine.connect() as conn:
    ...    conn.execute(text("SELECT * FROM users")).fetchall()
    [(0, 'User 6'), (1, 'User 7')]

    Use ``method`` to define a callable insertion method to do nothing
    if there's a primary key conflict on a table in a PostgreSQL database.

    >>> from sqlalchemy.dialects.postgresql import insert
    >>> def insert_on_conflict_nothing(table, conn, keys, data_iter):
    ...     # "a" is the primary key in "conflict_table"
    ...     data = [dict(zip(keys, row)) for row in data_iter]
    ...     stmt = insert(table.table).values(data).on_conflict_do_nothing(index_elements=["a"])
    ...     result = conn.execute(stmt)
    ...     return result.rowcount
    >>> df_conflict.to_sql(name="conflict_table", con=conn, if_exists="append", method=insert_on_conflict_nothing)  # doctest: +SKIP
    0

    For MySQL, a callable to update columns ``b`` and ``c`` if there's a conflict
    on a primary key.

    >>> from sqlalchemy.dialects.mysql import insert
    >>> def insert_on_conflict_update(table, conn, keys, data_iter):
    ...     # update columns "b" and "c" on primary key conflict
    ...     data = [dict(zip(keys, row)) for row in data_iter]
    ...     stmt = (
    ...         insert(table.table)
    ...         .values(data)
    ...     )
    ...     stmt = stmt.on_duplicate_key_update(b=stmt.inserted.b, c=stmt.inserted.c)
    ...     result = conn.execute(stmt)
    ...     return result.rowcount
    >>> df_conflict.to_sql(name="conflict_table", con=conn, if_exists="append", method=insert_on_conflict_update)  # doctest: +SKIP
    2

    Specify the dtype (especially useful for integers with missing values).
    Notice that while pandas is forced to store the data as floating point,
    the database supports nullable integers. When fetching the data with
    Python, we get back integer scalars.

    >>> df = pd.DataFrame({"A": [1, None, 2]})
    >>> df
         A
    0  1.0
    1  NaN
    2  2.0

    >>> from sqlalchemy.types import Integer
    >>> df.to_sql(name='integers', con=engine, index=False,
    ...           dtype={"A": Integer()})
    3

    >>> with engine.connect() as conn:
    ...   conn.execute(text("SELECT * FROM integers")).fetchall()
    [(1,), (None,), (2,)]

In [35]:
%%sql
TRUNCATE TABLE orders

 * postgresql://postgres:***@localhost:5432/local_retail_db
(psycopg2.errors.FeatureNotSupported) cannot truncate a table referenced in a foreign key constraint
DETAIL:  Table "order_items" references "orders".
HINT:  Truncate table "order_items" at the same time, or use TRUNCATE ... CASCADE.

[SQL: TRUNCATE TABLE orders]
(Background on this error at: https://sqlalche.me/e/20/tw8g)

In [37]:
df.to_sql('orders1',connection_uri,if_exists='replace',index=False)

883

In [38]:
pd.read_sql('orders1',connection_uri)

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [40]:
%%sql
TRUNCATE TABLE orders1

 * postgresql://postgres:***@localhost:5432/local_retail_db
Done.

[]

Now will see how to insert huge data in the form of multiple smaller chunks

In [42]:
ds_name = 'orders'

In [43]:
columns = get_column_names(schemas,ds_name)

In [44]:
df = pd.read_csv(f"data/retail_db/{ds_name}/part-00000",names = columns)

In [45]:
df

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [46]:
type(df)

pandas.core.frame.DataFrame

In [74]:
df_reader = pd.read_csv(f'data/retail_db/{ds_name}/part-00000',names=columns,chunksize=10000)

In [75]:
type(df_reader)

pandas.io.parsers.readers.TextFileReader

In [76]:
df_list = list(df_reader)

In [77]:
df_list[0]

      order_id             order_date  order_customer_id     order_status
0            1  2013-07-25 00:00:00.0              11599           CLOSED
1            2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2            3  2013-07-25 00:00:00.0              12111         COMPLETE
3            4  2013-07-25 00:00:00.0               8827           CLOSED
4            5  2013-07-25 00:00:00.0              11318         COMPLETE
...        ...                    ...                ...              ...
9995      9996  2013-09-25 00:00:00.0              11839          PENDING
9996      9997  2013-09-25 00:00:00.0               3471  PENDING_PAYMENT
9997      9998  2013-09-25 00:00:00.0               9419          PENDING
9998      9999  2013-09-25 00:00:00.0               1185           CLOSED
9999     10000  2013-09-25 00:00:00.0               8983       PROCESSING

[10000 rows x 4 columns]

In [78]:
df_list[1]

       order_id             order_date  order_customer_id     order_status
10000     10001  2013-09-25 00:00:00.0                316  PENDING_PAYMENT
10001     10002  2013-09-25 00:00:00.0               1530         COMPLETE
10002     10003  2013-09-25 00:00:00.0               8099         COMPLETE
10003     10004  2013-09-25 00:00:00.0               7768           CLOSED
10004     10005  2013-09-25 00:00:00.0                541         COMPLETE
...         ...                    ...                ...              ...
19995     19996  2013-11-25 00:00:00.0              11161  PENDING_PAYMENT
19996     19997  2013-11-25 00:00:00.0               1920         COMPLETE
19997     19998  2013-11-25 00:00:00.0              11672       PROCESSING
19998     19999  2013-11-25 00:00:00.0              10014         COMPLETE
19999     20000  2013-11-25 00:00:00.0                974  PENDING_PAYMENT

[10000 rows x 4 columns]

In [79]:
df_list[-1]

       order_id             order_date  order_customer_id     order_status
60000     60001  2013-10-20 00:00:00.0               1376         COMPLETE
60001     60002  2013-10-20 00:00:00.0               6345  PENDING_PAYMENT
60002     60003  2013-10-20 00:00:00.0                329       PROCESSING
60003     60004  2013-10-20 00:00:00.0              10907          PENDING
60004     60005  2013-10-20 00:00:00.0               5156         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[8883 rows x 4 columns]

In [80]:
for idx,df in enumerate(df_reader):
    print(f"size of chunk {idx} is {df.shape}")

In [86]:
idx = 1
for i in range(len(df_list)):
    print(f"size of chunk {i+1} is {df_list[i].shape}")
    idx +=1

size of chunk 1 is (10000, 4)
size of chunk 2 is (10000, 4)
size of chunk 3 is (10000, 4)
size of chunk 4 is (10000, 4)
size of chunk 5 is (10000, 4)
size of chunk 6 is (10000, 4)
size of chunk 7 is (8883, 4)

In [92]:
for i in range(len(df_list)):
    print(f"Processing chunk {i+1} of size {df_list[i].shape}")
    df_list[i].to_sql('orders1',connection_uri,if_exists='append',index=False)

Processing chunk 1 of size (10000, 4)
Processing chunk 2 of size (10000, 4)
Processing chunk 3 of size (10000, 4)
Processing chunk 4 of size (10000, 4)
Processing chunk 5 of size (10000, 4)
Processing chunk 6 of size (10000, 4)
Processing chunk 7 of size (8883, 4)

In [93]:
pd.read_sql(ds_name,connection_uri)

       order_id order_date  order_customer_id     order_status
0             1 2013-07-25              11599           CLOSED
1             2 2013-07-25                256  PENDING_PAYMENT
2             3 2013-07-25              12111         COMPLETE
3             4 2013-07-25               8827           CLOSED
4             5 2013-07-25              11318         COMPLETE
...         ...        ...                ...              ...
68878     68879 2014-07-09                778         COMPLETE
68879     68880 2014-07-13               1117         COMPLETE
68880     68881 2014-07-19               2518  PENDING_PAYMENT
68881     68882 2014-07-22              10000          ON_HOLD
68882     68883 2014-07-23               5533         COMPLETE

[68883 rows x 4 columns]

In [95]:
%%sql
DROP TABLE "departments-1"
DROP TABLE "categories-1"
DROP TABLE "orders-1"
DROP TABLE "products-1"
DROP TABLE "customers-1"
DROP TABLE "order_items-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
(psycopg2.errors.SyntaxError) syntax error at or near "DROP"
LINE 2: DROP TABLE "categories-1"
        ^

[SQL: DROP TABLE "departments-1"
DROP TABLE "categories-1"
DROP TABLE "orders-1"
DROP TABLE "products-1"
DROP TABLE "customers-1"
DROP TABLE "order_items-1"]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [96]:
%%sql
DROP TABLE "departments-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
Done.

[]

In [98]:
%%sql
DROP TABLE "categories-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
Done.

[]

In [99]:
%%sql
DROP TABLE "orders-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
Done.

[]

In [100]:
%%sql
DROP TABLE "products-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
Done.

[]

In [101]:
%%sql
DROP TABLE "customers-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
Done.

[]

In [102]:
%%sql
DROP TABLE "order_items-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
Done.

[]

In [10]:
%%sql
SELECT COUNT(*) FROM "departments-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
1 rows affected.

[(6,)]

In [11]:
%%sql
SELECT COUNT(*) FROM "categories-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
1 rows affected.

[(58,)]

In [12]:
%%sql
SELECT COUNT(*) FROM "orders-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
1 rows affected.

[(68883,)]

In [13]:
%%sql
SELECT COUNT(*) FROM "products-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
1 rows affected.

[(1345,)]

In [14]:
%%sql
SELECT COUNT(*) FROM "customers-1"

 * postgresql://postgres:***@localhost:5432/local_retail_db
1 rows affected.

[(12435,)]

In [15]:
%%sql
SELECT COUNT(*) FROM order_items

 * postgresql://postgres:***@localhost:5432/local_retail_db
1 rows affected.

[(172198,)]